software-engineering/debug/软件调试实战.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-26 四 14:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>软件调试实战读书笔记</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="刘尚亮" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">软件调试实战读书笔记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb2b1678">1. 第一章 谁编写软件，谁制造bug</a></li>
<li><a href="#orgd455381">2. 第二章 系统性调试方法</a></li>
<li><a href="#orgaefc2e6">3. 第三章 查找根源-源码调试器</a></li>
<li><a href="#org4c80596">4. 第四章 修复内存问题</a></li>
<li><a href="#org1bc9142">5. 第五章 剖析内存的使用</a></li>
<li><a href="#orgd037c66">6. 第六章 解决性能问题</a></li>
<li><a href="#org4ffed46">7. 第七章 调试并行程序</a></li>
<li><a href="#orgc0556bc">8. 第八章 查找环境和编译器问题</a>
<ul>
<li><a href="#orgb515064">8.1. 环境问题</a></li>
<li><a href="#orgba60f71">8.2. 编译器bug</a></li>
</ul>
</li>
<li><a href="#org4b7c48b">9. 第九章 处理链接问题</a></li>
<li><a href="#org1869db0">10. 第十章 高级调试</a></li>
<li><a href="#org197d9db">11. 第十一章 编写可调试的代码</a>
<ul>
<li><a href="#orgcf38133">11.1. 注释</a></li>
<li><a href="#org47cfcbe">11.2. 编码风格</a></li>
<li><a href="#org452ba25">11.3. 避免使用宏</a></li>
<li><a href="#org6cadc7c">11.4. 提供更多的调试函数</a></li>
</ul>
</li>
<li><a href="#orgb17114d">12. 第十二章 静态检查的作用</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb2b1678" class="outline-2">
<h2 id="orgb2b1678"><span class="section-number-2">1</span> 第一章 谁编写软件，谁制造bug</h2>
<div class="outline-text-2" id="text-1">
<p>
我们需要系统性的学习和实践调试方法。
</p>
</div>
</div>

<div id="outline-container-orgd455381" class="outline-2">
<h2 id="orgd455381"><span class="section-number-2">2</span> 第二章 系统性调试方法</h2>
<div class="outline-text-2" id="text-2">
<p>
构建和测试过程中有调试机会：
</p>
<ol class="org-ol">
<li>可调试的代码:</li>
<li>插装：</li>
<li>宏定义：</li>
<li>编译器标志：</li>
<li>静态检查器：</li>
<li>选择的库：</li>
<li>链接器工具：</li>
<li>代码插装工具：</li>
<li>测试用例/输入数据：</li>
<li>调试器</li>
</ol>
</div>
</div>

<div id="outline-container-orgaefc2e6" class="outline-2">
<h2 id="orgaefc2e6"><span class="section-number-2">3</span> 第三章 查找根源-源码调试器</h2>
<div class="outline-text-2" id="text-3">
<p>
如何系统的学习使用源码调试器：
</p>

<ol class="org-ol">
<li>运行程序（run,start）</li>
<li>栈跟踪（bt，backtrace，where,up,down）</li>
<li>断点（行，函数，条件，事件，观察点，捕获信号，捕获异常）</li>
<li>程序导航（pause，continue，next,step-in,step-out,step-over）</li>
<li>检查数据（print，display）</li>
</ol>
</div>
</div>

<div id="outline-container-org4c80596" class="outline-2">
<h2 id="org4c80596"><span class="section-number-2">4</span> 第四章 修复内存问题</h2>
<div class="outline-text-2" id="text-4">
<p>
常见的内存访问错误：
</p>

<ol class="org-ol">
<li>内存泄漏：例如，忘记执行free或delete。</li>
<li>内存管理错误使用：例如，重复释放，释放未分配的内存，内存释放后继续使用等。</li>
<li>缓冲区溢出：例如，读写越界等。</li>
<li>使用未初始化的内存。</li>
</ol>

<p>
调试工具：
</p>

<ol class="org-ol">
<li>Purify
<ul class="org-ul">
<li>使用purify_stop_here()函数在检测到错误时候调用gdb调试器。</li>
</ul></li>
<li>Valgrind
<ul class="org-ul">
<li>只能捕获动态分配的内存越界错误。</li>
<li>使用&#x2013;db-attach选项在检测到错误时候调用gdb调试器。</li>
</ul></li>
<li>Insure++
<ul class="org-ul">
<li>使用_Insure_trap_error()函数在检测到错误时候调用gdb调试器。</li>
</ul></li>
</ol>

<p>
内存调试器和源码调试器结合使用，定位出错位置。
</p>

<p>
高效使用排查工具：
</p>
<ol class="org-ol">
<li>使用内存调试器的排查规则</li>
<li>不要自动排查所有与第三方库有关的错误。</li>
</ol>

<p>
测试用例应该有很好的代码覆盖率。
</p>
</div>
</div>

<div id="outline-container-org1bc9142" class="outline-2">
<h2 id="org1bc9142"><span class="section-number-2">5</span> 第五章 剖析内存的使用</h2>
<div class="outline-text-2" id="text-5">
<p>
内存剖析的步骤：
</p>
<ol class="org-ol">
<li>检查是否有大的内存泄漏。</li>
<li>估计预期的内存使用。</li>
<li>用多个输入来测量内存使用随时间的变化。
<ul class="org-ul">
<li>top：观察rss</li>
<li>Valgrind：Massif工具</li>
</ul></li>
<li>查找使用内存的数据结构。
<ul class="org-ul">
<li>Valgrind：Massif工具</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orgd037c66" class="outline-2">
<h2 id="orgd037c66"><span class="section-number-2">6</span> 第六章 解决性能问题</h2>
<div class="outline-text-2" id="text-6">
<ol class="org-ol">
<li>程序执行时间。</li>
<li>工具：gprof，Quantify，Callgrind，VTune</li>
</ol>
</div>
</div>

<div id="outline-container-org4ffed46" class="outline-2">
<h2 id="org4ffed46"><span class="section-number-2">7</span> 第七章 调试并行程序</h2>
<div class="outline-text-2" id="text-7">
<p>
为什么并行会出问题：
</p>
<ol class="org-ol">
<li>对公共资源的访问。</li>
<li>语言代码对应机器指令不是原子执行。</li>
<li>异步事件和中断处理程序。</li>
</ol>

<p>
并行程序常见问题：
</p>
<ol class="org-ol">
<li>竞争条件
<ul class="org-ul">
<li>使用GDB调试机器代码：disassemble，stepi</li>
<li>使用带有时钟信息的日志。</li>
</ul></li>
<li>死锁
<ul class="org-ul">
<li>info stack， info thread</li>
</ul></li>
</ol>

<p>
工具：
</p>
<ul class="org-ul">
<li>Helgrind</li>
</ul>
</div>
</div>


<div id="outline-container-orgc0556bc" class="outline-2">
<h2 id="orgc0556bc"><span class="section-number-2">8</span> 第八章 查找环境和编译器问题</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgb515064" class="outline-3">
<h3 id="orgb515064"><span class="section-number-3">8.1</span> 环境问题</h3>
<div class="outline-text-3" id="text-8-1">
<ol class="org-ol">
<li>环境变量</li>
<li>本地安装依赖</li>
<li>当前工作目录依赖</li>
<li>进程ID依赖</li>
</ol>

<p>
查看进程状态的命令：top，ps，/proc/&lt;pid&gt;，strace，ltrace
</p>
</div>
</div>

<div id="outline-container-orgba60f71" class="outline-3">
<h3 id="orgba60f71"><span class="section-number-3">8.2</span> 编译器bug</h3>
</div>
</div>

<div id="outline-container-org4b7c48b" class="outline-2">
<h2 id="org4b7c48b"><span class="section-number-2">9</span> 第九章 处理链接问题</h2>
<div class="outline-text-2" id="text-9">
<ol class="org-ol">
<li>解析未定义的符号：
<ul class="org-ul">
<li>nm打印符号列表，</li>
<li>C++符号反改编（demangle）：分析实用工具或C++filt</li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-org1869db0" class="outline-2">
<h2 id="org1869db0"><span class="section-number-2">10</span> 第十章 高级调试</h2>
</div>

<div id="outline-container-org197d9db" class="outline-2">
<h2 id="org197d9db"><span class="section-number-2">11</span> 第十一章 编写可调试的代码</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-orgcf38133" class="outline-3">
<h3 id="orgcf38133"><span class="section-number-3">11.1</span> 注释</h3>
<div class="outline-text-3" id="text-11-1">
<p>
函数注释要点：
</p>
<ul class="org-ul">
<li>函数要做什么。</li>
<li>说明函数参数，以及在如何处理异常参数。</li>
<li>接口使用假设，比如是否必须在init函数之后使用。</li>
<li>内存分配，例如返回的指针由谁释放。</li>
<li>副作用。</li>
<li>记录所有已知的陷进和临时折中办法。</li>
</ul>
</div>
</div>

<div id="outline-container-org47cfcbe" class="outline-3">
<h3 id="org47cfcbe"><span class="section-number-3">11.2</span> 编码风格</h3>
<div class="outline-text-3" id="text-11-2">
<ul class="org-ul">
<li>不要压缩代码。</li>
<li>为复杂表达式使用临时变量。</li>
</ul>
</div>
</div>

<div id="outline-container-org452ba25" class="outline-3">
<h3 id="org452ba25"><span class="section-number-3">11.3</span> 避免使用宏</h3>
<div class="outline-text-3" id="text-11-3">
<ul class="org-ul">
<li>使用常量或枚举替代宏。</li>
<li>使用函数替代宏函数。</li>
</ul>
</div>
</div>

<div id="outline-container-org6cadc7c" class="outline-3">
<h3 id="org6cadc7c"><span class="section-number-3">11.4</span> 提供更多的调试函数</h3>
<div class="outline-text-3" id="text-11-4">
<p>
提供调试函数，方便在源码调试中调试自定义的数据结构。
</p>
</div>
</div>
</div>
<div id="outline-container-orgb17114d" class="outline-2">
<h2 id="orgb17114d"><span class="section-number-2">12</span> 第十二章 静态检查的作用</h2>
<div class="outline-text-2" id="text-12">
<ol class="org-ol">
<li>不要忽视编译器的警告。</li>
<li>使用多个编译器来检查代码。</li>
<li>使用静态分析工具。例如coverity，codecheck</li>
<li>静态分析的高级应用：
<ul class="org-ul">
<li>可移植性。</li>
<li>反向工程。</li>
<li>代码统计。</li>
<li>安全性。</li>
</ul></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 刘尚亮</p>
<p class="email">Email: <a href="mailto:phenix3443@gmail.com">phenix3443@gmail.com</a></p>
<p class="date">Created: 2020-03-26 四 14:32</p>
<p class="validation"></p>
</div>
</body>
</html>
